my_api/app/controllers/articles_controller.rb

  def index
    @articles = Article.first(10)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT ?  [["LIMIT", 10]]

  def create
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "DIO"], ["body", "そこに痺れる憧れる"], ["created_at", "2023-07-06 11:43:41.307950"], ["updated_at", "2023-07-06 11:43:41.307950"]]